app/controllers/events_controller.rb

INSERT INTO "events" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 3], ["created_at", "2015-03-04 23:21:08.182831"], ["updated_at", "2015-03-04 23:21:08.182831"]]
---
  def create

    event = current_user.events.new(event_params)

      if event.save