app/controllers/users_controller.rb

   def update
     user = User.find(params[:id])
    # respond_to do |format|
      if current_user.update(user_params) #could also use update_attributes method
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
UPDATE "users" SET "avatar_file_name" = $1, "avatar_content_type" = $2, "avatar_file_size" = $3, "avatar_updated_at" = $4, "updated_at" = $5 WHERE "users"."id" = $6

  def create

    user = User.new((user_params).merge(password:'12345'))

    #respond_to do |format|
      if user.save
---
INSERT INTO "users" ("email", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "first_name", "last_name", "street_address", "city", "state", "zip", "phone", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"