icarus/icarus/app/controllers/sessions_controller.rb

  def create

    # Find the user by email. The .where brings back a collection. The .first gives us the first one in that collection of users with that email. In the future, we'd set up our tables to accept only unique emails, so we'd not need the .first.
    u = User.where(email: params[:user][:email]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["email", "ricklesgibson@gmail.com"]]